benchmark/benchmarks/bastard/200_bench/apache_bench_results_3.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        bastard/0.6.8
Server Hostname:        localhost
Server Port:            8080

Document Path:          /jquery.txt
Document Length:        94840 bytes

Concurrency Level:      1
Time taken for tests:   18.278 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      951470000 bytes
HTML transferred:       948400000 bytes
Requests per second:    547.11 [#/sec] (mean)
Time per request:       1.828 [ms] (mean)
Time per request:       1.828 [ms] (mean, across all concurrent requests)
Transfer rate:          50835.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     1    2   0.8      2      10
Waiting:        1    2   0.8      1      10
Total:          1    2   0.8      2      10
WARNING: The median and mean for the waiting time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      6
  99%      6
 100%     10 (longest request)